answer-ls/Lummiss_Plant_Robot/src/demo/sdkconfig.defaults
# ESP32-P4 和开发板存储配置
CONFIG_IDF_TARGET="esp32p4"
# 当前 JC1060P470C 开发板实测芯片为 ESP32-P4 v1.3。
# P4 v1.x 与 v3.x 的程序不兼容，必须选择低于 v3.0 的硬件分支。
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

# 开发板带 32 MB PSRAM，摄像头帧缓冲使用外部内存。
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=150000

# 为测试任务和 USB Host 保留足够栈空间及控制传输缓冲区。
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=4096
CONFIG_USB_HOST_HW_BUFFER_BIAS_IN=y
CONFIG_PRINTF_UVC_CONFIGURATION_DESCRIPTOR=y

# LVGL 8 使用 RGB565；SPI 屏按高字节在前接收，因此在刷新前交换颜色字节。
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_BUILD_EXAMPLES=n
